; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v4 ?v3)
             (pred_7 ?v12 ?v11)
             (pred_3 ?v4 ?v11)
             (pred_12 ?v10 ?v4 )
	     (pred_10 ?v4)
             (pred_6 ?v2)
             (pred_11 ?v12)
             (pred_5 ?v11)
             (pred_9 ?v4)
             (pred_8 ?v12)
             (pred_1 ?v4)
             (pred_4 ))



(:action op_3
:parameters (?v1 ?v8 ?v13 ?v6)
:precondition (and (pred_6 ?v1) (pred_6 ?v8) (pred_11 ?v13) (pred_5 ?v6)
          (pred_2 ?v1 ?v8) (pred_7 ?v13 ?v6)
                   (pred_3 ?v8 ?v6) (pred_10 ?v1) 
                   (pred_9 ?v8) (pred_8 ?v13))
:effect (and  (pred_1 ?v8) (not (pred_9 ?v8))))


(:action op_2
:parameters (?v1 ?v7)
:precondition (and (pred_6 ?v1) (pred_6 ?v7)
               (pred_10 ?v1) (pred_2 ?v1 ?v7) (pred_1 ?v7))
:effect (and (pred_10 ?v7) (not (pred_10 ?v1))))

(:action op_4
:parameters (?v1 ?v13)
:precondition (and (pred_6 ?v1) (pred_11 ?v13) 
                  (pred_10 ?v1) (pred_12 ?v13 ?v1) (pred_4 ))
:effect (and (pred_8 ?v13)
   (not (pred_12 ?v13 ?v1)) (not (pred_4 ))))


(:action op_1
:parameters (?v1 ?v5 ?v9)
:precondition (and (pred_6 ?v1) (pred_11 ?v5) (pred_11 ?v9)
                  (pred_10 ?v1) (pred_8 ?v9) (pred_12 ?v5 ?v1))
:effect (and (pred_8 ?v5) (pred_12 ?v9 ?v1)
        (not (pred_8 ?v9)) (not (pred_12 ?v5 ?v1))))

(:action op_5
:parameters (?v1 ?v13)
:precondition (and (pred_6 ?v1) (pred_11 ?v13) 
                  (pred_10 ?v1) (pred_8 ?v13))
:effect (and (pred_4 ) (pred_12 ?v13 ?v1) (not (pred_8 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_01 obj_07 obj_15 obj_17 obj_26 obj_23 obj_09 obj_22 obj_29 obj_10 obj_04 obj_18 obj_19 obj_06 obj_25 obj_27 obj_08 obj_28 obj_12 obj_16 obj_11 obj_21 obj_13 obj_03
    obj_20 obj_14
    obj_30 obj_02 obj_05
    )

    (:init
       (pred_4)

       (pred_6 obj_24)
       (pred_6 obj_01)
       (pred_6 obj_07)
       (pred_6 obj_15)
       (pred_6 obj_17)
       (pred_6 obj_26)
       (pred_6 obj_23)
       (pred_6 obj_09)
       (pred_6 obj_22)
       (pred_6 obj_29)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_18)
       (pred_6 obj_19)
       (pred_6 obj_06)
       (pred_6 obj_25)
       (pred_6 obj_27)
       (pred_6 obj_08)
       (pred_6 obj_28)
       (pred_6 obj_12)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_21)
       (pred_6 obj_13)
       (pred_6 obj_03)
       (pred_5 obj_20)
       (pred_5 obj_14)
       (pred_11 obj_30)
       (pred_11 obj_02)
       (pred_11 obj_05)

       (pred_2 obj_24 obj_26)
       (pred_2 obj_24 obj_01)
       (pred_2 obj_01 obj_23)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_01 obj_24)
       (pred_2 obj_07 obj_09)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_15 obj_22)
       (pred_2 obj_15 obj_17)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_17 obj_29)
       (pred_2 obj_17 obj_15)
       (pred_2 obj_26 obj_10)
       (pred_2 obj_26 obj_23)
       (pred_2 obj_26 obj_24)
       (pred_2 obj_23 obj_04)
       (pred_2 obj_23 obj_09)
       (pred_2 obj_23 obj_01)
       (pred_2 obj_23 obj_26)
       (pred_2 obj_09 obj_18)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_09 obj_07)
       (pred_2 obj_09 obj_23)
       (pred_2 obj_22 obj_19)
       (pred_2 obj_22 obj_29)
       (pred_2 obj_22 obj_15)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_29 obj_06)
       (pred_2 obj_29 obj_17)
       (pred_2 obj_29 obj_22)
       (pred_2 obj_10 obj_25)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_10 obj_26)
       (pred_2 obj_04 obj_27)
       (pred_2 obj_04 obj_18)
       (pred_2 obj_04 obj_23)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_09)
       (pred_2 obj_18 obj_04)
       (pred_2 obj_19 obj_28)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_22)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_06 obj_29)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_25 obj_16)
       (pred_2 obj_25 obj_27)
       (pred_2 obj_25 obj_10)
       (pred_2 obj_27 obj_11)
       (pred_2 obj_27 obj_08)
       (pred_2 obj_27 obj_04)
       (pred_2 obj_27 obj_25)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_08 obj_28)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_08 obj_27)
       (pred_2 obj_28 obj_13)
       (pred_2 obj_28 obj_12)
       (pred_2 obj_28 obj_19)
       (pred_2 obj_28 obj_08)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_28)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_25)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_11 obj_27)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_21 obj_13)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_13 obj_03)
       (pred_2 obj_13 obj_28)
       (pred_2 obj_13 obj_21)
       (pred_2 obj_03 obj_12)
       (pred_2 obj_03 obj_13)
       (pred_9 obj_27)
       (pred_9 obj_21)
       (pred_9 obj_18)
       (pred_3  obj_27 obj_20)
       (pred_3  obj_21 obj_14)
       (pred_3  obj_18 obj_20)
       (pred_1 obj_24)
       (pred_1 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_15)
       (pred_1 obj_17)
       (pred_1 obj_26)
       (pred_1 obj_23)
       (pred_1 obj_09)
       (pred_1 obj_22)
       (pred_1 obj_29)
       (pred_1 obj_10)
       (pred_1 obj_04)
       (pred_1 obj_19)
       (pred_1 obj_06)
       (pred_1 obj_25)
       (pred_1 obj_08)
       (pred_1 obj_28)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_03)

       (pred_7  obj_30 obj_20)
       (pred_7  obj_02 obj_14)
       (pred_7  obj_05 obj_14)
       (pred_12 obj_30 obj_11)
       (pred_12 obj_02 obj_15)
       (pred_12 obj_05 obj_19)
       (pred_10 obj_11)
    )

    (:goal (and
       (pred_12 obj_02 obj_21)
    ))
(:constraints
  (always (not (pred_10 obj_08)))
)
)

; plan
1. (op_4 obj_11 obj_30)
   deleted: (pred_12 obj_30 obj_11) (pred_4)
   added: (pred_8 obj_30)
   goals met: 0 of 1
2. (op_3 obj_11 obj_27 obj_30 obj_20)
   deleted: (pred_9 obj_27)
   added: (pred_1 obj_27)
   goals met: 0 of 1
3. (op_2 obj_11 obj_27)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_27)
   goals met: 0 of 1
4. (op_5 obj_27 obj_30)
   deleted: (pred_8 obj_30)
   added: (pred_4) (pred_12 obj_30 obj_27)
   goals met: 0 of 1
5. (op_2 obj_27 obj_04)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_04)
   goals met: 0 of 1
6. (op_2 obj_04 obj_23)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_23)
   goals met: 0 of 1
7. (op_2 obj_23 obj_09)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_09)
   goals met: 0 of 1
8. (op_2 obj_09 obj_22)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_22)
   goals met: 0 of 1
9. (op_2 obj_22 obj_15)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_15)
   goals met: 0 of 1
10. (op_4 obj_15 obj_02)
   deleted: (pred_12 obj_02 obj_15) (pred_4)
   added: (pred_8 obj_02)
   goals met: 0 of 1
11. (op_2 obj_15 obj_22)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_22)
   goals met: 0 of 1
12. (op_2 obj_22 obj_19)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_19)
   goals met: 0 of 1
13. (op_2 obj_19 obj_28)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_28)
   goals met: 0 of 1
14. (op_2 obj_28 obj_13)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_13)
   goals met: 0 of 1
15. (op_3 obj_13 obj_21 obj_02 obj_14)
   deleted: (pred_9 obj_21)
   added: (pred_1 obj_21)
   goals met: 0 of 1
16. (op_2 obj_13 obj_21)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_21)
   goals met: 0 of 1
17. (op_5 obj_21 obj_02)
   deleted: (pred_8 obj_02)
   added: (pred_4) (pred_12 obj_02 obj_21)
   goals met: 1 of 1
